/* eslint-disable no-useless-escape */
export const RGX = {
  NAME_RGX: /^[ '.a-zA-Z_ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềểếẾỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷýỹ]+$/u,
  EMAIL_RGX: /^([\w.%+-]+)@([\w-]+\.)+([\w]{2,})$/i,
  URL_RGX: /[(http(s)?):\/\/(www\.)?a-zA-Z0-9@:%._\+~#=]{2,256}\.[a-z]{2,6}\b([-a-zA-Z0-9@:%_\+.~#?&//=]*)/,
  PASSWORD_STRONG_RGX: /^(?=.*[0-9])(?=.*[A-Z])(?=.*[a-z])(?=.*[#$@!%&*?])[a-zA-Z0-9#$@!%&*?]{8,20}$/gm,
  PHONE_RGX: /^[0-9]{10}$/
};
